validation/momentum/sameDensity/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alphaGas 1
    volVectorFieldValue U (0 0. 0)
);

regions
(
    boxToCell
    {
        box (-1 0 -1) (1 0.0201 1);
        fieldValues
        (
            volScalarFieldValue alphaGas 0
            volVectorFieldValue U (0 0 0)
        );
    }
);


// ************************************************************************* //
